
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 10 to add, 10 to change, 6 to destroy.</code></pre>

* Create
  * module.sftp_storage.azapi_update_resource.defender_settings
  * module.sftp_storage.time_rotating.rotate
  * module.sftp_storage.time_static.pim_expiry
  * module.sftp_storage.time_static.pim_start
* Update
  * azapi_resource.add_local_user
  * azurerm_key_vault_secret.correspondence_topic_primary_shared_access_key
  * azurerm_key_vault_secret.evidence_share_topic_primary_shared_access_key
  * module.metric-alert.azurerm_resource_group_template_deployment.metric-alert
  * module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace
  * module.sftp_storage.azurerm_storage_account.storage_account
  * module.sscs-fail-action-group.azurerm_resource_group_template_deployment.action-group
  * module.sscs-fail-action-group-slack.azurerm_resource_group_template_deployment.action-group
  * module.sscs-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.sscs-sya-submit-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0]
* Replace
  * module.correspondence-subscription.azurerm_servicebus_subscription.servicebus_subscription
  * module.correspondence-topic.azurerm_servicebus_topic.servicebus_topic
  * module.correspondence-topic.azurerm_servicebus_topic_authorization_rule.send_listen_auth_rule
  * module.evidenceshare-subscription.azurerm_servicebus_subscription.servicebus_subscription
  * module.evidenceshare-topic.azurerm_servicebus_topic.servicebus_topic
  * module.evidenceshare-topic.azurerm_servicebus_topic_authorization_rule.send_listen_auth_rule


<details><summary>Change Result (Click me)</summary>

```hcl

  # azapi_resource.add_local_user will be updated in-place
  ~ resource "azapi_resource" "add_local_user" {
      ~ body                      = (sensitive value)
        id                        = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.Storage/storageAccounts/sscssftpprod/localUsers/sscsprod"
        name                      = (sensitive value)
      ~ output                    = jsonencode({}) -> (known after apply)
        tags                      = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.correspondence_topic_primary_shared_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "correspondence_topic_primary_shared_access_key" {
        id                      = "https://sscs-prod.vault.azure.net/secrets/correspondence-topic-shared-access-key/87f200f3dc52460c943f34c9921b42ce"
        name                    = "correspondence-topic-shared-access-key"
        tags                    = {
            "Team Contact"        = "#sscs"
            "Team Name"           = "SSCS Team"
            "application"         = "social-service-child-support"
            "builtFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#sscs-tech"
            "environment"         = "production"
            "managedBy"           = "SSCS"
            "source"              = "Service Bus sscs-correspondence-topic-prod"
        }
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.evidence_share_topic_primary_shared_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "evidence_share_topic_primary_shared_access_key" {
        id                      = "https://sscs-prod.vault.azure.net/secrets/evidence-share-topic-shared-access-key/4a92ed686ea144899180ae46a1221e6a"
        name                    = "evidence-share-topic-shared-access-key"
        tags                    = {
            "Team Contact"        = "#sscs"
            "Team Name"           = "SSCS Team"
            "application"         = "social-service-child-support"
            "builtFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#sscs-tech"
            "environment"         = "production"
            "managedBy"           = "SSCS"
            "source"              = "Service Bus sscs-evidenceshare-topic-prod"
        }
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.correspondence-subscription.data.azurerm_servicebus_topic.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_topic" "this" {
      + auto_delete_on_idle                     = (known after apply)
      + default_message_ttl                     = (known after apply)
      + duplicate_detection_history_time_window = (known after apply)
      + enable_batched_operations               = (known after apply)
      + enable_express                          = (known after apply)
      + enable_partitioning                     = (known after apply)
      + id                                      = (known after apply)
      + max_size_in_megabytes                   = (known after apply)
      + name                                    = "sscs-correspondence-topic-prod"
      + namespace_id                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-prod"
      + requires_duplicate_detection            = (known after apply)
      + status                                  = (known after apply)
      + support_ordering                        = (known after apply)
    }

  # module.correspondence-subscription.azurerm_servicebus_subscription.servicebus_subscription must be replaced
-/+ resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      ~ id                                        = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-prod/topics/sscs-correspondence-topic-prod/subscriptions/sscs-correspondence-subscription-prod" -> (known after apply)
        name                                      = "sscs-correspondence-subscription-prod"
      ~ topic_id                                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-prod/topics/sscs-correspondence-topic-prod" -> (known after apply) # forces replacement
        # (12 unchanged attributes hidden)
    }

  # module.correspondence-topic.data.azurerm_resource_group.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "this" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "sscs-prod"
      + tags       = (known after apply)
    }

  # module.correspondence-topic.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "sscs-servicebus-prod"
      + premium_messaging_partitions        = (known after apply)
      + resource_group_name                 = "sscs-prod"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
    }

  # module.correspondence-topic.azurerm_servicebus_topic.servicebus_topic must be replaced
-/+ resource "azurerm_servicebus_topic" "servicebus_topic" {
      ~ id                                      = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-prod/topics/sscs-correspondence-topic-prod" -> (known after apply)
        name                                    = "sscs-correspondence-topic-prod"
      ~ namespace_id                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-prod" -> (known after apply) # forces replacement
        # (11 unchanged attributes hidden)
    }

  # module.correspondence-topic.azurerm_servicebus_topic_authorization_rule.send_listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_topic_authorization_rule" "send_listen_auth_rule" {
      ~ id                                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-prod/topics/sscs-correspondence-topic-prod/authorizationRules/SendAndListenSharedAccessKey" -> (known after apply)
        name                              = "SendAndListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
      ~ topic_id                          = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-prod/topics/sscs-correspondence-topic-prod" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.evidenceshare-subscription.data.azurerm_servicebus_topic.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_topic" "this" {
      + auto_delete_on_idle                     = (known after apply)
      + default_message_ttl                     = (known after apply)
      + duplicate_detection_history_time_window = (known after apply)
      + enable_batched_operations               = (known after apply)
      + enable_express                          = (known after apply)
      + enable_partitioning                     = (known after apply)
      + id                                      = (known after apply)
      + max_size_in_megabytes                   = (known after apply)
      + name                                    = "sscs-evidenceshare-topic-prod"
      + namespace_id                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-prod"
      + requires_duplicate_detection            = (known after apply)
      + status                                  = (known after apply)
      + support_ordering                        = (known after apply)
    }

  # module.evidenceshare-subscription.azurerm_servicebus_subscription.servicebus_subscription must be replaced
-/+ resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      ~ id                                        = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-prod/topics/sscs-evidenceshare-topic-prod/subscriptions/sscs-evidenceshare-subscription-prod" -> (known after apply)
        name                                      = "sscs-evidenceshare-subscription-prod"
      ~ topic_id                                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-prod/topics/sscs-evidenceshare-topic-prod" -> (known after apply) # forces replacement
        # (12 unchanged attributes hidden)
    }

  # module.evidenceshare-topic.data.azurerm_resource_group.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "this" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "sscs-prod"
      + tags       = (known after apply)
    }

  # module.evidenceshare-topic.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "sscs-servicebus-prod"
      + premium_messaging_partitions        = (known after apply)
      + resource_group_name                 = "sscs-prod"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
    }

  # module.evidenceshare-topic.azurerm_servicebus_topic.servicebus_topic must be replaced
-/+ resource "azurerm_servicebus_topic" "servicebus_topic" {
      ~ id                                      = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-prod/topics/sscs-evidenceshare-topic-prod" -> (known after apply)
        name                                    = "sscs-evidenceshare-topic-prod"
      ~ namespace_id                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-prod" -> (known after apply) # forces replacement
        # (11 unchanged attributes hidden)
    }

  # module.evidenceshare-topic.azurerm_servicebus_topic_authorization_rule.send_listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_topic_authorization_rule" "send_listen_auth_rule" {
      ~ id                                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-prod/topics/sscs-evidenceshare-topic-prod/authorizationRules/SendAndListenSharedAccessKey" -> (known after apply)
        name                              = "SendAndListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
      ~ topic_id                          = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-prod/topics/sscs-evidenceshare-topic-prod" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.metric-alert.data.template_file.actiongrouptemplate will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "actiongrouptemplate" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            {
              + "$schema"      = "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + actionGroupsExternalId    = {
                      + type = "string"
                    }
                  + alertDescription          = {
                      + type = "string"
                    }
                  + alertEvaluationFrequency  = {
                      + type = "string"
                    }
                  + alertQuery                = {
                      + type = "string"
                    }
                  + alertSeverity             = {
                      + type = "string"
                    }
                  + alertWindowSize           = {
                      + type = "string"
                    }
                  + commonTags                = {
                      + type = "string"
                    }
                  + location                  = {
                      + type = "string"
                    }
                  + scheduledQueryRulesName   = {
                      + type = "string"
                    }
                  + storageAccountsExternalId = {
                      + type = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2022-06-15"
                      + location   = "[parameters('location')]"
                      + name       = "[parameters('scheduledQueryRulesName')]"
                      + properties = {
                          + actions                = {
                              + actionGroups     = [
                                  + "[parameters('actionGroupsExternalId')]",
                                ]
                              + actionProperties = {}
                              + customProperties = {}
                            }
                          + autoMitigate           = false
                          + criteria               = {
                              + allOf = [
                                  + {
                                      + dimensions      = []
                                      + failingPeriods  = {
                                          + minFailingPeriodsToAlert  = 1
                                          + numberOfEvaluationPeriods = 1
                                        }
                                      + operator        = "GreaterThan"
                                      + query           = "[parameters('alertQuery')]"
                                      + threshold       = 0
                                      + timeAggregation = "Count"
                                    },
                                ]
                            }
                          + description            = "[parameters('alertDescription')]"
                          + displayName            = "[parameters('scheduledQueryRulesName')]"
                          + enabled                = true
                          + evaluationFrequency    = "[parameters('alertEvaluationFrequency')]"
                          + overrideQueryTimeRange = "P2D"
                          + scopes                 = [
                              + "[parameters('storageAccountsExternalId')]",
                            ]
                          + severity               = "[parameters('alertSeverity')]"
                          + targetResourceTypes    = [
                              + "Microsoft.Storage/storageAccounts",
                            ]
                          + windowSize             = "[parameters('alertWindowSize')]"
                        }
                      + tags       = "[variables('tags')]"
                      + type       = "microsoft.insights/scheduledqueryrules"
                    },
                ]
              + variables      = {
                  + tags = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        )
    }

  # module.metric-alert.azurerm_resource_group_template_deployment.metric-alert will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "metric-alert" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.Resources/deployments/sscs-fail-alert-sscssftp-email"
        name                     = "sscs-fail-alert-sscssftp-email"
      ~ output_content           = jsonencode({}) -> (known after apply)
        tags                     = {}
      ~ template_content         = jsonencode(
            {
              - "$schema"      = "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - actionGroupsExternalId    = {
                      - type = "String"
                    }
                  - alertDescription          = {
                      - type = "String"
                    }
                  - alertEvaluationFrequency  = {
                      - type = "String"
                    }
                  - alertQuery                = {
                      - type = "String"
                    }
                  - alertSeverity             = {
                      - type = "String"
                    }
                  - alertWindowSize           = {
                      - type = "String"
                    }
                  - commonTags                = {
                      - type = "String"
                    }
                  - location                  = {
                      - type = "String"
                    }
                  - scheduledQueryRulesName   = {
                      - type = "String"
                    }
                  - storageAccountsExternalId = {
                      - type = "String"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2022-06-15"
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('scheduledQueryRulesName')]"
                      - properties = {
                          - actions                = {
                              - actionGroups     = [
                                  - "[parameters('actionGroupsExternalId')]",
                                ]
                              - actionProperties = {}
                              - customProperties = {}
                            }
                          - autoMitigate           = false
                          - criteria               = {
                              - allOf = [
                                  - {
                                      - dimensions      = []
                                      - failingPeriods  = {
                                          - minFailingPeriodsToAlert  = 1
                                          - numberOfEvaluationPeriods = 1
                                        }
                                      - operator        = "GreaterThan"
                                      - query           = "[parameters('alertQuery')]"
                                      - threshold       = 0
                                      - timeAggregation = "Count"
                                    },
                                ]
                            }
                          - description            = "[parameters('alertDescription')]"
                          - displayName            = "[parameters('scheduledQueryRulesName')]"
                          - enabled                = true
                          - evaluationFrequency    = "[parameters('alertEvaluationFrequency')]"
                          - overrideQueryTimeRange = "P2D"
                          - scopes                 = [
                              - "[parameters('storageAccountsExternalId')]",
                            ]
                          - severity               = "[parameters('alertSeverity')]"
                          - targetResourceTypes    = [
                              - "Microsoft.Storage/storageAccounts",
                            ]
                          - windowSize             = "[parameters('alertWindowSize')]"
                        }
                      - tags       = "[variables('tags')]"
                      - type       = "microsoft.insights/scheduledqueryrules"
                    },
                ]
              - variables      = {
                  - tags = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        ) -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace will be updated in-place
  ~ resource "azurerm_servicebus_namespace" "servicebus_namespace" {
        id                                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-prod"
      ~ minimum_tls_version                 = "1.0" -> "1.2"
        name                                = "sscs-servicebus-prod"
        tags                                = {
            "Team Contact"        = "#sscs"
            "Team Name"           = "SSCS Team"
            "application"         = "social-service-child-support"
            "builtFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#sscs-tech"
            "environment"         = "production"
            "managedBy"           = "SSCS"
        }
        # (12 unchanged attributes hidden)
    }

  # module.sftp_storage.azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = {
          + properties = {
              + isEnabled                         = false
              + malwareScanning                   = {
                  + onUpload = {
                      + capGBPerMonth = -1
                      + isEnabled     = false
                    }
                }
              + overrideSubscriptionLevelSettings = true
              + sensitiveDataDiscovery            = {
                  + isEnabled = false
                }
            }
        }
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.Storage/storageAccounts/sscssftpprod"
      + resource_id             = (known after apply)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.sftp_storage.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.Storage/storageAccounts/sscssftpprod"
        name                               = "sscssftpprod"
        tags                               = {
            "application"         = "social-service-child-support"
            "builtFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#sscs-tech"
            "environment"         = "production"
            "managedBy"           = "SSCS"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sftp_storage.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.sftp_storage.time_static.pim_expiry will be created
  + resource "time_static" "pim_expiry" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.sftp_storage.time_static.pim_start will be created
  + resource "time_static" "pim_start" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.sscs-fail-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.Resources/deployments/SSCSF_alert"
        name                     = "SSCSF_alert"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ actionGroupId = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.sscs-fail-action-group-slack.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.Resources/deployments/SSCSF_slack"
        name                     = "SSCSF_slack"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ actionGroupId = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.sscs-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.Resources/deployments/sscs-fail-alert"
        name                     = "sscs-fail-alert"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged attributes hidden)
                    }
                }
                # (4 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.sscs-sya-submit-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.Resources/deployments/sscs-sya-submit-fail"
        name                     = "sscs-sya-submit-fail"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged attributes hidden)
                    }
                }
                # (4 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

Plan: 10 to add, 10 to change, 6 to destroy.

Changes to Outputs:
  ~ evidence_share_topic_primary_shared_access_key = (sensitive value)
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":197,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->